# Calulator

A simple command line calculator to evaluate expressions.


# Supported Operations
## Brackets
Bracketed expressions are supported in the calculator. Use brackets to group and enforce out of order operations.

(2*3)

(5\*6\*3)

Expression: 2*(1+2)

Result: 6


## Exponents
Use the notation ^ for exponents.

To raise 2 to the third power:

Expression: 2^3

Result: 8


## Root (Fractional exponents)
Use the notation r for fractional exponents.

To raise 8 to the power of 1/3 (3rd root of 8):

Expression: 3r8

Result: 2

## Division
Use the / operator for division.

Expression: 6/3

Result: 2


## Multiplication
Use the * operator to utilize multiplcation.

Expression: 2*3

Result: 6

## Addition
Use the + operator for addition.

Expression: 2+3
Result: 5

## Subtraction
Use the - operator for subtraction

Excpression: 3-1

Result: 2

# Example
Expression: 1\+(2\+(2\*3\*(6\+1)))\*4\+(5\+6)\+7\/(7\*(6\/3\*2\^3))

Result: 188